Revit 2026 API

# WireMaterialTypeRemoveGroundConductorSize Method

---

Remove an existing ground conductor size from this material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveGroundConductorSize(
	GroundConductorSize grdConductorSize
)
```
```vb
Public Sub RemoveGroundConductorSize (
	grdConductorSize As GroundConductorSize
)
```
```cpp
public:
void RemoveGroundConductorSize(
	GroundConductorSize^ grdConductorSize
)
```
```fsharp
member RemoveGroundConductorSize :
        grdConductorSize : GroundConductorSize -> unit
```

#### Parameters

grdConductorSize GroundConductorSize
    The ground size type to be removed.

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace